{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented portfolio features including Hero, About, Skills, Projects, Resume, and Contact sections with their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the purpose and functionality of each component, hook, and configuration file in the portfolio application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system variables for light and dark themes, including background, foreground, accent, and UI component colors.",
  "frontend/index.html": "HTML entry point with meta tags, viewport configuration, and title for Alex Chen's developer portfolio application.",
  "frontend/src/App.tsx": "Main React application component that renders Navigation, all portfolio sections (Hero, About, Skills, Projects, Resume, Contact), and Footer in a structured layout.",
  "frontend/src/components/About.tsx": "About Me section component with a professional bio emphasizing technical curiosity and career goals, featuring scroll-triggered fade-in animation using useScrollAnimation hook.",
  "frontend/src/components/Contact.tsx": "Contact section with email/social links (GitHub, LinkedIn) and a functional contact form with validation, state management, and focus animations.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and caffeine.ai attribution link with UTM tracking parameters and dynamic app identifier.",
  "frontend/src/components/Hero.tsx": "Hero section with name display, title, introduction paragraph, and two CTA buttons (View Projects, Download Resume) featuring staggered entrance animations on page load.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar with smooth scroll links to all sections, backdrop blur effect on scroll, and animated underline hover effects.",
  "frontend/src/components/ProjectCard.tsx": "A React component that displays a project card with title, description, tech stack tags, and buttons linking to GitHub and live demo. Features hover animations and uses shadcn/ui Card components.",
  "frontend/src/components/Projects.tsx": "Displays a grid of featured projects using ProjectCard components with scroll animations. Contains hardcoded project data for an e-commerce platform, task manager, weather dashboard, and social media analytics tool.",
  "frontend/src/components/Resume.tsx": "A section component that displays a resume download card with a button to download a PDF file from the public directory. Uses scroll animations for entrance effects.",
  "frontend/src/components/Skills.tsx": "Displays categorized technical skills (Languages, Frontend, Backend, Databases, Tools) in a responsive grid layout with hover effects and scroll animations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages Internet Computer actor instances using React Query, creating authenticated or anonymous actors based on Internet Identity login state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "An intentionally empty file placeholder indicating that the portfolio application uses static content and does not require backend data fetching.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to detect when an element enters the viewport and returns a ref and visibility boolean for triggering scroll-based animations.",
  "frontend/src/index.css": "Global styles defining CSS custom properties for light/dark themes using OKLCH color space, typography settings with Inter font, and Tailwind base/utility layers with smooth scrolling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography with Inter font, extended shadows, border radius variables, and animation keyframes for accordions and fade effects.",
  "project_state.json": "Project state file defining a developer portfolio website for a Computer Science student with modern minimal design, smooth animations, and recruiter-friendly layout. Contains architectural notes, existing features (Hero, About, Skills, Projects, Resume, Contact sections), and requirements tracking."
}